VV_cases/V2_thermal/results/study_v2a/runs/005_data_of13_fluid_consistency_short/simulations/Re60_ogrid/openfoam_setup/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10240
(
(0.075789037 0.00034279024 0)
(0.075789037 0.00034285833 0)
(0.075789037 0.00034282743 0)
(0.075789037 0.00034268283 0)
(0.075789037 0.00034240827 0)
(0.075789037 0.00034198582 0)
(0.075789037 0.00034139577 0)
(0.075789037 0.00034061653 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.075789 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    cylinder
    {
        type            noSlip;
    }
    front
    {
        type symmetryPlane;
    }
    back
    {
        type symmetryPlane;
    }
}


// ************************************************************************* //
