VV_cases/V2_thermal/results/study_v2a/runs/005_data_of13_fluid_consistency_short/simulations/Re60_ogrid/openfoam_setup/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet { type calculated; value $internalField; }
    outlet { type calculated; value $internalField; }
    top { type calculated; value $internalField; }
    bottom { type calculated; value $internalField; }
    cylinder { type calculated; value $internalField; }
    front { type symmetryPlane; }
    back { type symmetryPlane; }
}
